""" модуль для отримання даних про постачання та вивід їх на екран
"""



def get_dovidnik1():
    
    from_dovidnik1 = [
    
  "КНТЕУ;202;10;10",               
  "КНЕУ;203;20;10",                  
  "КНУ;205;30;5",                   
  "КНТЕУ;207;40;10",            
  "КНЕУ;211;20;5",                   
  "КНУ;204;10;5",                                                                                    
  "КНТЕУ;206;30;5",                                                                                        
  "КНЕУ;210;50;3",                   
  "КНУ;212;60;4",
  "КНТЕУ;213;70;5",
    ]

    dovidnik1_list = []

  for line = from_file:
      line_list = line.split(";") 
      dovidnik1_list.append((line_list))

    ]
    return from_dovidnik1

def get_dovidnik2():
                                                                                 
    
    from_dovidnik2 = [
     "10;План розрахунків  бухгалтерського обліку підприємств;40" , 
     "20;ППП УЗПИКС;900",
     "30;ППП УТЕП;900",
     "40;ППП УОС;600",
     "50;ППП УФРО;1245",
     "60;АРМ бухгалтера матеріально-технічного відділу відділу;500", 
     "70;АРМ бухгалтера фінансового відділу;500" ,
     "80;ППП Облік договорів;150", 

    ]
    return from_dovidnik2

def get_dovidnik3():
    
    from_dovidnik3 = [
                                                                                      "Таблиця 3",

"АРМ бухгалтера фінансового відділу;212;КНУ;4;50;200",
"АРМ бухгалтера матеріально-технічного відділу;213;КНТЕУ;5;500;2500",
"План рахунків бухгалтерського обліку підприємств;202;КНТЕУ;10;40;400",
"План рахунків бухгалтерського обліку підприємств;204;КНУ;5;40;200",
"ППП УФРО;210;КНЕУ;3;124;372"
    ]
    
    return from_dovidnik3

def get_orders():
    pass

dovidnik1_list = get_dovidnik1()
dovidnik2_list = get_dovidnik2()
dovidnik3_list = get_dovidnik3()

for x in dovidnik1_list:
    print(x)
for y in dovidnik2_list:
    print(y)
for z in dovidnik3_list:
    print(z)